# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

a = [2, 3, 4, 5, 6]
b = len(a) / 2
if type(b) == float:
    b += 0.5
    b = int(b)

print(b)
c = []
d = []
for i in a[-1:len(a) % 2:-1]:
    c.append(i)
for i in a[0:b:1]:
    d.append(i)

print(c)
print(d)
e =  []
for i in range(0,len(c)):
    e.append(c[i]*d[i])
    
print(e)

